---
kind: property
id: P:Autodesk.Revit.DB.BuiltInFailures.EnergyAnalysisFailures.UndefinedRooms
source: html/3510176b-9396-48c3-286b-cd9398402b09.htm
---
# Autodesk.Revit.DB.BuiltInFailures.EnergyAnalysisFailures.UndefinedRooms Property

There are undefined Rooms in the model! Recommend creating a Room schedule and checking the Area parameter of each Room for warnings.

## Syntax (C#)
```csharp
public static FailureDefinitionId UndefinedRooms { get; }
```